ts.ui.DatePicker.localize({
	firstDay: 1,
	monthNames: [
		'1月',
		'2月',
		'3月',
		'4月',
		'5月',
		'6月',
		'7月',
		'8月',
		'9月',
		'10月',
		'11月',
		'12月'
	],
	monthNamesShort: [
		'1月',
		'2月',
		'3月',
		'4月',
		'5月',
		'6月',
		'7月',
		'8月',
		'9月',
		'10月',
		'11月',
		'12月'
	],
	dayNames: ['日曜日', '月曜日', '火曜日', '水曜日', '木曜日', '金曜日', '土曜日'],
	dayNamesShort: ['日曜日', '月曜日', '火曜日', '水曜日', '木曜日', '金曜日', '土曜日'],
	dayNamesMin: ['日曜', '月曜', '火曜', '水曜', '木曜', '金曜', '土曜'],
	deselect: '選択を解除'
});

ts.ui.Footer.localize({
	collaboration: 'オープンコラボレーション'
});
